; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-4-6-7-6)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-2 pos1-3 pos2-0 pos2-1 pos2-2 pos2-3
    shape0 shape1 shape2 shape3 shape4 shape5
    key0 key1 key2 key3 key4 key5 key6
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (shape shape4)
       (shape shape5)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)
       (key key6)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-2)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (locked pos2-1)
       (locked pos1-3)
       (locked pos0-3)
       (locked pos1-2)
       (locked pos2-3)
       (locked pos1-0)
       (lock-shape  pos2-1 shape0)
       (lock-shape  pos1-3 shape1)
       (lock-shape  pos0-3 shape2)
       (lock-shape  pos1-2 shape3)
       (lock-shape  pos2-3 shape4)
       (lock-shape  pos1-0 shape5)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos1-1)
       (open pos2-0)
       (open pos2-2)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape4)
       (key-shape  key5 shape5)
       (key-shape  key6 shape3)
       (at key0 pos1-1)
       (at key1 pos0-2)
       (at key2 pos1-3)
       (at key3 pos0-0)
       (at key4 pos0-2)
       (at key5 pos2-1)
       (at key6 pos0-2)
       (at-robot pos0-0)
    )

    (:goal (and
       (at key0 pos2-0)
       (at key1 pos1-1)
       (at key2 pos0-2)
       (at key3 pos0-2)
       (at key4 pos2-2)
       (at key5 pos0-2)
       (at key6 pos1-2)
    )))

; plan
1. (pickup pos0-0 key3)
   deleted: (at key3 pos0-0) (arm-empty)
   added: (holding key3)
   goals met: 0 of 7
2. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 0 of 7
3. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 0 of 7
4. (unlock pos0-2 pos1-2 key3 shape3)
   deleted: (locked pos1-2)
   added: (open pos1-2)
   goals met: 0 of 7
5. (pickup-and-loose pos0-2 key1 key3)
   deleted: (holding key3) (at key1 pos0-2)
   added: (holding key1) (at key3 pos0-2)
   goals met: 1 of 7
6. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 1 of 7
7. (unlock pos1-2 pos1-3 key1 shape1)
   deleted: (locked pos1-3)
   added: (open pos1-3)
   goals met: 1 of 7
8. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 1 of 7
9. (pickup-and-loose pos1-1 key0 key1)
   deleted: (holding key1) (at key0 pos1-1)
   added: (holding key0) (at key1 pos1-1)
   goals met: 2 of 7
10. (unlock pos1-1 pos2-1 key0 shape0)
   deleted: (locked pos2-1)
   added: (open pos2-1)
   goals met: 2 of 7
11. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 2 of 7
12. (move pos2-1 pos2-0)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-0)
   goals met: 2 of 7
13. (putdown pos2-0 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos2-0)
   goals met: 3 of 7
14. (move pos2-0 pos2-1)
   deleted: (at-robot pos2-0)
   added: (at-robot pos2-1)
   goals met: 3 of 7
15. (pickup pos2-1 key5)
   deleted: (at key5 pos2-1) (arm-empty)
   added: (holding key5)
   goals met: 3 of 7
16. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 3 of 7
17. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 3 of 7
18. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 3 of 7
19. (pickup-and-loose pos0-2 key6 key5)
   deleted: (holding key5) (at key6 pos0-2)
   added: (holding key6) (at key5 pos0-2)
   goals met: 4 of 7
20. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 4 of 7
21. (putdown pos1-2 key6)
   deleted: (holding key6)
   added: (arm-empty) (at key6 pos1-2)
   goals met: 5 of 7
22. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 5 of 7
23. (pickup pos1-3 key2)
   deleted: (at key2 pos1-3) (arm-empty)
   added: (holding key2)
   goals met: 5 of 7
24. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 5 of 7
25. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 5 of 7
26. (pickup-and-loose pos0-2 key4 key2)
   deleted: (holding key2) (at key4 pos0-2)
   added: (holding key4) (at key2 pos0-2)
   goals met: 6 of 7
27. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 6 of 7
28. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 6 of 7
29. (putdown pos2-2 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos2-2)
   goals met: 7 of 7
